# EXL_GetSheetSize

## Description
Get size of Excel sheets.

```pascal
FUNCTION EXL_GetSheetSize(
				sheetIndex     : INTEGER;
				VAR outRows    : INTEGER;
				VAR outColumns : INTEGER): BOOLEAN;
```

```python
def vs.EXL_GetSheetSize(sheetIndex):
    return (BOOLEAN, outRows, outColumns)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|sheetIndex|INTEGER|   |
|outRows|INTEGER|   |
|outColumns|INTEGER|   |

## Version
Availability: from Vectorworks 2021

## Category
* Excel